
/*const CourseCategory = ['Армирование ж/б конструкций',
'Каркасные деревянные здания',
'Деревянные конструкции малоэтажных домов',
'Английский для строителей'

];
*/
const CourseCategory = [
    {
        id: "1",
        label: 'Армирование ж/б конструкций',
        nodes:[
            {
            id: "1",
            label: "СП63 П.1",
            },
            {
            id: "2",
            label: "СП63 П.2",
            },
            {id: "3",
            label: "СП63 П.3",
            }

            ]
    },
    {
        id: "2",
        label:'Каркасные деревянные здания'},
    {
        id: "3",
        label:'Деревянные конструкции малоэтажных домов'},
    {
        id: "4",
        label:'Английский для строителей'},
    {   
        id: "5",
        label:'Инженерная геология'},
    {
        id: "6",
        label:'Строительная механика'},
    {
        id: "7",
        label:'Сопротивление материалов'}
    
    
    
    
    
    ];
export default CourseCategory;