
//КАТЕГОРИИ
/*
const TestCategory = [
'Железобетонные конструкции',
'Стальные конструкции',
'Деревянные конструкции',
'Основания и фундаменты',
'Инженерная геология',
'Строительная механика',
'Сопротивление материалов'
];
*/
//NEW DATA
// TestCategory[0].id
const TestCategory = [
    {
        id: "1",
        label: 'Железобетонные конструкции',
        nodes:[
            {
            id: "1",
            label: "СП63 П.1",
            },
            {
            id: "2",
            label: "СП63 П.2",
            },
            {id: "3",
            label: "СП63 П.3",
            }

            ]
    },
    {
        id: "2",
        label:'Стальные конструкции'},
    {
        id: "3",
        label:'Деревянные конструкции'},
    {
        id: "4",
        label:'Основания и фундаменты'},
    {   
        id: "5",
        label:'Инженерная геология'},
    {
        id: "6",
        label:'Строительная механика'},
    {
        id: "7",
        label:'Сопротивление материалов'}
    
    
    
    
    
    ];

export default TestCategory;