
//КАТЕГОРИИ
/*
const TestCategory = [
'Железобетонные конструкции',
'Стальные конструкции',
'Деревянные конструкции',
'Основания и фундаменты',
'Инженерная геология',
'Строительная механика',
'Сопротивление материалов'
];
*/
//NEW DATA
// TestCategory[0].id
const TestCategory = [
    {
        id: "1",
        label: 'Железобетонные конструкции',
        nodes:[
            {
            id: "1",
            label: "СП63 ",
            nodes:[
                {
                id: "1",
                label: "СП63 п.1 "
                },
                {
                id: "2",
                label: "СП63 п.2 "
                }

            ]
            },
            {
            id: "2",
            label: "СП70",
            },
            {id: "3",
            label: "СП356",
            nodes:[
                {
                id: "1",
                label: "СП356 п.1 "
                },
                {
                id: "2",
                label: "СП356 п.2 "
                }

            ]
            }

            ]
    },
    {
        id: "2",
        label:'Стальные конструкции',
        nodes:[
            {
            id: "1",
            label: "СП16 ",
            nodes:[
                {
                id: "1",
                label: "СП16 п.1 "
                },
                {
                id: "2",
                label: "СП16 п.2 "
                }

            ]
            },
            {
            id: "2",
            label: "Горев",
            },
            {id: "3",
            label: "Беленя",
            nodes:[{id: "1",
            label: "ddd"},{id: "2",
            label: "ddfff"}]
            }

            ]
    },
    {
        id: "3",
        label:'Деревянные конструкции'},
    {
        id: "4",
        label:'Основания и фундаменты'},
    {   
        id: "5",
        label:'Инженерная геология'},
    {
        id: "6",
        label:'Строительная механика'},
    {
        id: "7",
        label:'Сопротивление материалов'},
    {
        id: "8",
        label:'Сопротивление материалов1'}
    
    
    
    
    
    
    ];

export default TestCategory;